---
kind: method
id: M:Autodesk.Revit.DB.AXMImportOptions.#ctor
source: html/2841fedf-f40b-e7d7-b783-5290b669371d.htm
---
# Autodesk.Revit.DB.AXMImportOptions.#ctor Method

Constructs a new instance of AXMImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public AXMImportOptions()
```